
<details><summary>Show Format output</summary>

```terraform

provider.tf
::error::Terraform exited with code 3.
```

</details>

<details><summary>Show Init output</summary>

```terraform

[0m[1mInitializing HCP Terraform...[0m
[0m[1mInitializing provider plugins...[0m
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v5.81.0...
- Installed hashicorp/aws v5.81.0 (signed by HashiCorp)
Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mHCP Terraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with HCP Terraform. Try running "terraform plan" to
see any changes that are required for your infrastructure.

If you ever set or change modules or Terraform Settings, run "terraform init"
again to reinitialize your working directory.[0m
```

</details>

<details><summary>Show Validate output</summary>

```terraform

Success! The configuration is valid.
```

</details>

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/postech-fiap-alura/totem-express/runs/run-mYJzHymX64EhjeY1

Waiting for the plan to start...

Terraform v1.10.0
on linux_amd64
Initializing plugins and modules...
data.aws_iam_role.labrole: Refreshing...
data.aws_availability_zones.available: Refreshing...
aws_ecr_repository.repository: Refreshing state... [id=totem_express]
aws_vpc.vpc: Refreshing state... [id=vpc-0d933b9232c7e8e4d]
data.aws_iam_role.labrole: Refresh complete after 0s [id=LabRole]
data.aws_availability_zones.available: Refresh complete after 0s [id=us-east-1]
aws_internet_gateway.igw: Refreshing state... [id=igw-0fb059ccef9fc2d93]
aws_subnet.subnets[1]: Refreshing state... [id=subnet-0de1ea6e3cf03fe79]
aws_subnet.subnets[0]: Refreshing state... [id=subnet-06f59676217b35db3]
aws_security_group.ssh_cluster: Refreshing state... [id=sg-00c9d816be0c05bd5]
aws_route_table.rt: Refreshing state... [id=rtb-0b6caf4981a86d337]
aws_eks_cluster.eks-cluster: Refreshing state... [id=totem_express-8soat]
aws_route_table_association.rt-assiciation[1]: Refreshing state... [id=rtbassoc-0dfed9c269a509589]
aws_route_table_association.rt-assiciation[0]: Refreshing state... [id=rtbassoc-0c42e93a03d7a154d]
aws_eks_access_policy_association.eks-policy: Refreshing state... [id=totem_express-8soat#arn:aws:iam::924978846501:role/voclabs#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
aws_eks_access_entry.access-entry: Refreshing state... [id=totem_express-8soat:arn:aws:iam::924978846501:role/voclabs]
aws_eks_node_group.node-group: Refreshing state... [id=totem_express-8soat:totem_express-ng]
aws_eks_node_group.node-group: Drift detected (update)
aws_eks_access_entry.access-entry: Drift detected (update)
aws_eks_access_policy_association.eks-policy: Drift detected (update)
aws_eks_cluster.eks-cluster: Drift detected (update)
aws_ecr_repository.repository: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eks_node_group.node-group must be replaced
-/+ resource "aws_eks_node_group" "node-group" {
      ~ ami_type               = "AL2023_x86_64_STANDARD" -> (known after apply)
      ~ arn                    = "arn:aws:eks:us-east-1:993896961632:nodegroup/totem_express-8soat/totem_express-ng/56c9e8e9-8eda-7a96-08e6-d8b8c0e95703" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ disk_size              = 20 -> (known after apply)
      ~ id                     = "totem_express-8soat:totem_express-ng" -> (known after apply)
      ~ instance_types         = [ # forces replacement
          ~ "t2.micro" -> "t3.medium",
        ]
      - labels                 = {} -> null
      + node_group_name_prefix = (known after apply)
      ~ release_version        = "1.31.3-20241205" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-totem_express-ng-56c9e8e9-8eda-7a96-08e6-d8b8c0e95703"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ status                 = "ACTIVE" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      ~ version                = "1.31" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ update_config {
          - max_unavailable_percentage = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @JoaoHL, Action: `pull_request`*